case/benchMark/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(   
( 0.0 0.0 0.0 )
( 0.111611652352 0.0 0.0 )
( 0.288388347648 0.0 0.0 )
( 0.6 0.0 0.0 )
( 2.5 0.0 0.0 )
( 0.0 0.111611652352 0.0 )
( 0.111611652352 0.111611652352 0.0 )
( 0.288388347648 0.111611652352 0.0 )
( 0.6 0.111611652352 0.0 )
( 2.5 0.111611652352 0.0 )
( 0.0 0.288388347648 0.0 )
( 0.111611652352 0.288388347648 0.0 )
( 0.288388347648 0.288388347648 0.0 )
( 0.6 0.288388347648 0.0 )
( 2.5 0.288388347648 0.0 )
( 0.0 0.41 0.0 )
( 0.111611652352 0.41 0.0 )
( 0.288388347648 0.41 0.0 )
( 0.6 0.41 0.0 )
( 2.5 0.41 0.0 )
( 0.164644660941 0.164644660941 0.0 )
( 0.235355339059 0.164644660941 0.0 )
( 0.248989794856 0.19 0.0 )
( 0.30625 0.19 0.0 )
( 0.6 0.19 0.0 )
( 2.5 0.19 0.0 )
( 0.164644660941 0.235355339059 0.0 )
( 0.235355339059 0.235355339059 0.0 )
( 0.248989794856 0.21 0.0 )
( 0.30625 0.21 0.0 )
( 0.6 0.21 0.0 )
( 2.5 0.21 0.0 )
( 0.0 0.0 0.01 )
( 0.111611652352 0.0 0.01 )
( 0.288388347648 0.0 0.01 )
( 0.6 0.0 0.01 )
( 2.5 0.0 0.01 )
( 0.0 0.111611652352 0.01 )
( 0.111611652352 0.111611652352 0.01 )
( 0.288388347648 0.111611652352 0.01 )
( 0.6 0.111611652352 0.01 )
( 2.5 0.111611652352 0.01 )
( 0.0 0.288388347648 0.01 )
( 0.111611652352 0.288388347648 0.01 )
( 0.288388347648 0.288388347648 0.01 )
( 0.6 0.288388347648 0.01 )
( 2.5 0.288388347648 0.01 )
( 0.0 0.41 0.01 )
( 0.111611652352 0.41 0.01 )
( 0.288388347648 0.41 0.01 )
( 0.6 0.41 0.01 )
( 2.5 0.41 0.01 )
( 0.164644660941 0.164644660941 0.01 )
( 0.235355339059 0.164644660941 0.01 )
( 0.248989794856 0.19 0.01 )
( 0.30625 0.19 0.01 )
( 0.6 0.19 0.01 )
( 2.5 0.19 0.01 )
( 0.164644660941 0.235355339059 0.01 )
( 0.235355339059 0.235355339059 0.01 )
( 0.248989794856 0.21 0.01 )
( 0.30625 0.21 0.01 )
( 0.6 0.21 0.01 )
( 2.5 0.21 0.01 )
);

blocks
(    
hex ( 0 1 6 5 32 33 38 37 ) (44 44 1 ) simpleGrading ( 0.5 0.8 1.0 )
hex ( 1 2 7 6 33 34 39 38 ) (74 44 1 ) simpleGrading ( 1.0 0.8 1.0 )
hex ( 2 3 8 7 34 35 40 39 ) (149 44 1 ) simpleGrading ( 2.0 0.8 1.0 )
hex ( 3 4 9 8 35 36 41 40 ) (345 44 1 ) simpleGrading ( 5.0 0.8 1.0 )
hex ( 5 6 11 10 37 38 43 42 ) (44 70 1 ) simpleGrading ( 0.5 1.0 1.0 )
hex ( 6 7 21 20 38 39 53 52 ) (74 74 1 ) simpleGrading ( 1.0 0.4 1.0 )
hex ( 7 8 24 23 39 40 56 55 ) (149 36 1 ) simpleGrading ( 2.0 0.769230769231 1.0 )
hex ( 8 9 25 24 40 41 57 56 ) (345 36 1 ) simpleGrading ( 5.0 0.769230769231 1.0 )
hex ( 6 20 26 11 38 52 58 43 ) (74 70 1 ) simpleGrading ( 0.4 1.0 1.0 )
hex ( 21 7 23 22 53 39 55 54 ) (74 36 1 ) simpleGrading ( 2.5 0.769230769231 1.0 )
hex ( 24 25 31 30 56 57 63 62 ) (345 12 1 ) simpleGrading ( 5.0 1.0 1.0 )
hex ( 26 27 12 11 58 59 44 43 ) (74 74 1 ) simpleGrading ( 1.0 2.5 1.0 )
hex ( 28 29 12 27 60 61 44 59 ) (74 36 1 ) simpleGrading ( 2.5 1.3 1.0 )
hex ( 29 30 13 12 61 62 45 44 ) (149 36 1 ) simpleGrading ( 2.0 1.3 1.0 )
hex ( 30 31 14 13 62 63 46 45 ) (345 36 1 ) simpleGrading ( 5.0 1.3 1.0 )
hex ( 10 11 16 15 42 43 48 47 ) (44 48 1 ) simpleGrading ( 0.5 1.25 1.0 )
hex ( 11 12 17 16 43 44 49 48 ) (74 48 1 ) simpleGrading ( 1.0 1.25 1.0 )
hex ( 12 13 18 17 44 45 50 49 ) (149 48 1 ) simpleGrading ( 2.0 1.25 1.0 )
hex ( 13 14 19 18 45 46 51 50 ) (345 48 1 ) simpleGrading ( 5.0 1.25 1.0 )
);

edges
(
arc 20 21 (0.2 0.15 0.0 ) 
arc 21 22 (0.246193976626 0.180865828382 0.0 ) 
arc 28 27 (0.246193976626 0.219134171618 0.0 ) 
arc 27 26 (0.2 0.25 0.0 ) 
arc 26 20 (0.15 0.2 0.0 ) 
arc 6 7 (0.2 0.09375 0.0 ) 
arc 7 23 (0.303936447408 0.156948113859 0.0 ) 
arc 29 12 (0.303936447408 0.243051886141 0.0 ) 
arc 12 11 (0.2 0.30625 0.0 ) 
arc 11 6 (0.09375 0.2 0.0 ) 
arc 52 53 (0.2 0.15 0.01 ) 
arc 53 54 (0.246193976626 0.180865828382 0.01 ) 
arc 60 59 (0.246193976626 0.219134171618 0.01 ) 
arc 59 58 (0.2 0.25 0.01 ) 
arc 58 52 (0.15 0.2 0.01 ) 
arc 38 39 (0.2 0.09375 0.01 ) 
arc 39 55 (0.303936447408 0.156948113859 0.01 ) 
arc 61 44 (0.303936447408 0.243051886141 0.01 ) 
arc 44 43 (0.2 0.30625 0.01 ) 
arc 43 38 (0.09375 0.2 0.01 ) 
);

patches
(      
wall inlet
(
( 0 32 37 5 )
( 5 37 42 10 )
( 10 42 47 15 )
)

wall outlet
(
( 4 9 41 36 )
( 9 25 57 41 )
( 25 31 63 57 )
( 31 14 46 63 )
( 14 19 51 46 )
)

wall plate
(
( 23 22 54 55 )
( 24 23 55 56 )
( 24 56 62 30 )
( 29 61 60 28 )
( 30 62 61 29 )
)

wall cylinder
(
( 21 20 52 53 )
( 21 53 54 22 )
( 28 60 59 27 )
( 27 59 58 26 )
( 20 26 58 52 )
)

wall bottom
(
( 1 33 32 0 )
( 2 34 33 1 )
( 3 35 34 2 )
( 4 36 35 3 )
)

wall top
(
( 16 15 47 48 )
( 17 16 48 49 )
( 18 17 49 50 )
( 19 18 50 51 )
)

);

mergePatchPairs
(
);

// ************************************************************************* //