case/benchMark/constant/solid/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(   
( 0.248989794856 0.19 0.0 )
( 0.30625 0.19 0.0 )
( 0.6 0.19 0.0 )
( 0.248989794856 0.21 0.0 )
( 0.30625 0.21 0.0 )
( 0.6 0.21 0.0 )
( 0.248989794856 0.19 0.01 )
( 0.30625 0.19 0.01 )
( 0.6 0.19 0.01 )
( 0.248989794856 0.21 0.01 )
( 0.30625 0.21 0.01 )
( 0.6 0.21 0.01 )
);

blocks
(    
hex ( 0 1 4 3 6 7 10 9 ) (74 12 1 ) simpleGrading ( 2.5 1 1 )
hex ( 1 2 5 4 7 8 11 10 ) (149 12 1 ) simpleGrading ( 2 1 1 )
);

edges
(
);

patches
(      
wall plateFix
(
( 0 6 9 3 )
)

wall plate
(
( 4 3 9 10 )
( 1 7 6 0 )
( 5 4 10 11 )
( 2 8 7 1 )
( 2 5 11 8 )
)

);

mergePatchPairs
(
);

// ************************************************************************* //